# Case-Study: Salaries EDA

# import pandas as pd

In [4]:
import pandas as pd

# Read Salaries.csv as a dataframe

In [5]:
df = pd.read_csv('Salaries.csv')

# Check the head of the Dataframe

In [6]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

# use the .inf() method to find out how many entries there  are

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148049 non-null object
OvertimePay         148654 non-null object
OtherPay            148654 non-null object
Benefits            112495 non-null object
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              38119 non-null object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [8]:
df.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [9]:
df.head(4)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN

# what is the average Basepay

In [13]:
df['TotalPay'].mean()

74768.321971703

# What is the hightest amount of Overtimepay in the dataset

In [14]:
df['TotalPayBenefits'].max()

567595.43

# What is the job title of JOSEPH DRISCOLL

In [19]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

# How Much does JOSEPH DRISCOLL make (including benefits)

In [23]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

# What is the name of highest paid person (icluding benefits) ?

In [40]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

# What is the name of Lowest paid person (including benefits)?
# Do you notice something strange about how much he or she is paid ?

In [41]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

# What was the average (Mean) Basepay of all emloyess per year ?(2011-2014)

In [54]:
df.groupby('Year').mean()['TotalPay']

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

# How many unique job titles are there ?

In [55]:
df['JobTitle'].nunique()

2159

# what are the top 5 most common job ?

In [59]:
df['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

# How many job titles were represented by only one person in 2013 ? (e.g. job titles with only one occurence in 2013?)

In [69]:
(df[df['Year']==2013]['JobTitle'].value_counts() == 1 ).sum()

202

# How many people have the word  Chief in their job title ? (this is pretty tricky)

In [72]:
def chief(string):
    if 'chief' in (string.lower()):
        return True 
    else:
        return False

In [74]:
(df['JobTitle'].apply(lambda x: chief(x))).sum()

627

# Bonus: is there a correlation between lengh of the job title string and Salary ?

In [75]:
df['ntitles'] = df['JobTitle'].apply(len)
df['ntitles']

0         46
1         31
2         31
3         36
4         44
5         25
6         34
7         30
8         34
9         38
10        48
11        31
12        27
13        17
14        34
15        34
16        17
17        37
18        34
19        26
20        26
21        26
22        25
23        34
24        25
25        15
26        25
27        34
28        36
29        44
          ..
148624    12
148625    16
148626    13
148627    15
148628    15
148629    18
148630     9
148631    27
148632    26
148633    15
148634    19
148635    15
148636    19
148637    22
148638    11
148639     9
148640    23
148641    12
148642    11
148643    23
148644    28
148645    25
148646    12
148647    27
148648     9
148649     9
148650    12
148651    12
148652    12
148653    26
Name: ntitles, Length: 148654, dtype: int64

In [76]:
df[['ntitles','TotalPayBenefits']].corr()

                   ntitles  TotalPayBenefits
ntitles           1.000000         -0.036878
TotalPayBenefits -0.036878          1.000000